<a href="https://colab.research.google.com/github/rtxverma123/Python/blob/main/Pandas_Operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Unique Values

In [2]:
df['col2'].unique() #All unique values

array([444, 555, 666])

In [3]:
len(df['col2'].unique())

3

In [4]:
df['col2'].value_counts() #Number of unique values

444    2
555    1
666    1
Name: col2, dtype: int64

Selectiing Data

In [5]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [6]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

Applying our own function with apply() method

In [9]:
def times2(x):
  return x*2

In [10]:
df['col1'].apply(times2) #To apply our own function

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [12]:
df['col2'].apply(lambda x:x*2) #With Lambda

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

Sorting Values according to the coloumn

In [13]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [14]:
df.isnull() #Check values are null or not

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

**Pivot Tables**

In [15]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [16]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN